<template>
     <div class="doc-div">
        <div>
      <h1>
          知识推理引擎使用指南
      </h1>
      <p>
          知识推理模块将用户的行业知识以图谱的形式储存，当对话系统中用户提及相关知识的时候，
          机器人可以分析用户的语义并依照图谱内的知识点以及互相的关系来做推论、
          回答。支持用户全量上传、页面上的新增、修改、检视知识点以及互相之间的关系。
      </p>
      <h1>
          知识推理
      </h1>
      <h2>
          什么是知识推理？
      </h2>
      <p>
          知识推理（Knowledge Graph）：是把现实世界的实体（人或事）信息数据存储起来，并在数据之间建立联系，用于描述真实世界中存在的各种实体以及它们之间强关系的一种产品。
      </p>
        <p>
            实体（entity）、属性（property）：
            知识推理引擎旨在描述真实世界中存在的各种实体或概念及其关系，其构成一张巨大的语义网络图，
            节点表示实体，边则由属性构成。所谓的实体，一般是指现实世界存在的事物（人或事），而属性用于描述某一实体的特征。用“属性--值对”来刻画该实体下属性的内在特性，
            比如某个人物，他有年龄、身高、体重等属性，而具体到每一个属性，会有具体的数值。
        </p>
        <h2>
            数据管理
        </h2>
        <p>
            数据总览是知识推理引擎的核心功能，可允许用户批量导入知识推理引擎数据，并可对已导入的实体属性对应的值进行手动编辑。
        </p>
        <p>
            数据管理：可针对知识推理引擎的数据库进行编辑。
        </p>
        <p>
            a) 数据总览：可针对实体的属性编辑值
        </p>
        <p>
            b) 实体管理：可针对实体进行相关定义
        </p>
        <p>
            c) 属性管理：可针对属性进行相关定义
        </p>
        <p>
            d) 词库管理：可针对实体、属性、值进行同义词的定义
        </p>
        <p>
            成功导入数据后，实体、相关属性和他们对应的值会展示在数据总览界面。页面左侧展示实体间的关系。
            页面右侧展示已选实体或实体集合的属性和值，实体在首列展示，属性在首行展示，交叉处展示实体属性对应的值。
        </p>
        <h2>
            实体管理
        </h2>
        <p>
            实体管理功能可允许对知识推理引擎中的实体进行层级、同义词、简介等的定义及编辑。
            实体关系模块可用来定义实体的层级、新增、修改及删除实体。实体关系列表模块可用来定义实体的同义词和简介等详细信息。
        </p>
        <p>
            点击实体简介后的不同按钮可给实体添加不同类型的简介。实体简介可在询问特定的同义词、语料或单独询问实体时触发。
        </p>
        <h2>
            属性管理
        </h2>
        <p>
            属性管理功能可允许对知识推理引擎中的属性进行同义词、语料、类型、单位、话术、简介等的定义及编辑。并允许针对不同实体搭配通用属性时类型、单位、话术不同的情况进行补充编辑。
        </p>
        <p>
            属性管理界面分为两个模块：通用属性、补充属性。通用属性界面，默认展示全部属性，
            以及其同义词、语料、类型、单位、话术等内容。补充属性界面，默认展示全部补充属性，以及其应用实体、类型、话术等内容。
        </p>
        <h1>
            知识推理词库
        </h1>
        <h2>
            知识推理词库的作用？
        </h2>
        <p>
            词库管理功能可允许对知识推理引擎中的实体、属性和值进行同义词的编辑。词库管理界面分为三个模块：实体词库、属性词库和值词库。
        </p>
        <p>
            实体词库是专门针对实体的同义词进行管理的页面，本页面和【实体管理】页面中的同义词编辑同步。
        </p>
        <p>
            属性词库是专门针对属性的同义词进行管理的页面，本页面和【属性管理】页面中的同义词编辑同步。
        </p>
        <p>
            值词库是专门针对属性类型为关键字的值的同义词进行管理的页面。
        </p>
        <h2>
            测试报告
        </h2>
        <p>
            知识推理引擎的功能测试报告功能可允许上传测试题，并进行批量测试。
        </p>
        <p>
            测试集列表中会显示所有上传过的测试集，并显示测试集的名称、测试时间、测试集状态以及正确率。
            点击具体的测试集，页面右侧会展示具体测试集内部的测试题详情，包括测试题内容、
            用户编辑的期望答案以及机器人预测的测试答案，回答正确的测试题会以绿色展示，回答错误的测试题会以橘色展示。
        </p>
        <h2>
            变更审核
        </h2>
        <p>
            知识推理引擎的变更审核功能可允许用户将修改的数据同步到线上，或回滚到之前版本。当知识推理引擎数据有变动时，若选择【变更审核】，会提示“沙箱数据存在变更，是否需要发布”。
        </p>
  </div>
    </div>
</template>

<script>
export default{
  data() {
    return {
      msg: 'haha',
    };
  },
};
</script>
<style lang="scss" scoped>
.doc-div{
    max-height: calc(100vh - 60px);
    display: flex;
    flex-direction: column;
    overflow: hidden;
    div{
        margin: 20px 0;
        padding: 0 20px;
        overflow: auto;
    }
}
  h1 {
      display: block;
    font-size: 20px;
    margin-block-start: 0em;
    margin-block-end: 0.67em;
    margin-inline-start: 0px;
    margin-inline-end: 0px;
    font-weight: bold;
  }
  h2 {
  display: block;
  font-size: 16px;
  margin-block-start: 0em;
  margin-block-end: 0.83em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
  font-weight: bold;
}
p {
  line-height: 1.4;
  font-size: 14px;
  display: block;
  margin-block-start: 1em;
  margin-block-end: 1em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
}
</style>
