<template>
    <div class="doc-div">
        <div>
    <!-- 一级标题写在h1里面，二级标签写在h2里面，正文内容写在p里面， -->
    <h1>技能简介</h1>
    <h2>什么是技能发现？</h2>
   <p>技能发现是预制的一系列技能，直接开启就可以使用。本地技能，支持本地调用，发现技能，仅支持云端调用。</p>
    <h2>什么是技能开发？</h2>
    <p>技能开发，是非常方便简单的技能编辑方式，用户可以创建意图（自然语言的意图理解）、
        实体槽位解析多轮配置和话术设置，完成一个技能的创建。最终实现终端用户使用自然语言唤醒机器人或其他智能设备上的应用/能力。</p>
    <h2>如何技能创建</h2>
    <p>创建技能，是为了解放终端用户的双手，终端用户可以通过自然语言语音的方式， 唤醒终端设备，
        并通过对话交互，达成自己的任务目标。开发者最多创建200个技能，技能支持编辑和删除。在开发与配置技能时，你需要完成以下内容：</p>
    <h2>创建意图</h2>
    <p>意图是触发技能的入口。你可以通过维护自然语言语句（即终端使用者可能会表达的话术），定义一个技能的意图信息。</p>
    <p>如：你想创建一个“订酒店”的意图，你可以输入意图表达“帮我订一晚明天的酒店”</p>
    <h2>意图与槽位设计</h2>
    <p>添加意图表达后，NLP（自然语言处理）自动识别到的槽位信息。（请尽可能完整的添加每一句意图表达，模拟用户口吻），这里需要事先建自定义词典。</p>
    <p>意图中文名和英文名必须填写，英文名不可用空格，可用“下划线_”代替。回车添加意图表达式：
        主要是指使用者的说法，至少要有 1 句是包含全部的槽位信息。意图语料支持导入、导出、搜索、全局解析等，导入为增量导入，点击全局解析则所有语料进行重新解析。</p>
   <h1>多轮设计</h1>
    <h2>追问话术的作用？</h2>
    <p>配置技能与用户之间多轮对话，有一些必须获取的槽位信息可以勾选必须。勾选必须的槽位，需要填写追问话术。</p>
    <p>为了更好的语音交互体验，目前只允许设置四个必须槽位，当用户与终端对话时，如果必须槽位未获得槽值，
        终端会使用预先设置的追问话术与用户进行多轮交互，但最多只会追问两次。追问文案最多添加 5 条，会随机回复一条。</p>
   <h2>什么是意图确认？</h2>
    <p>技能的执行需要二次确认时（如“发短信给张三”，“充100元给某人”），用户可以设置合适的意图确认，
        对该技能指令做再次确认。意图确认话术，可以引用槽位（话术中引用槽位：$+槽位识别名）。如果没有必须槽位，也无需意图确认，技能就立即执行。</p>
    <h2>什么是技能回复？</h2>
    <p>技能回复支持两大类：文字回复、WebAPI回复。</p>
    <p>文字回复：纯文字回复，终端将文字展示并播报给用户。</p>
    <p>WEB API回复：开发者通过web API方式自定义回复内容。自定义技能将用户对话中的槽值抽取出来，
        作为web API的输入，获取相关资源（文本、音频、图片等）再通过平台可接受的格式，返回给技能。</p>
    <h2>实体解析设置</h2>
    <p>实体解析指命名实体识别（Named Entity Recognition，简称NER）又称专名识别，
        是指识别文本中具有特定意义的实体。主要包括人名、地名、机构名、专有名词，以及时间、数量、货币、比例数值等文字。</p>
    <p>在自定义技能上，除了系统提供的「通用解析」外，还允许用户配置「词典解析」。</p>
  </div>
    </div>
</template>

<script>
export default{
  data() {
    return {
      msg: 'haha',
    };
  },
};
</script>
<style lang="scss" scoped>
.doc-div{
    max-height: calc(100vh - 60px);
    display: flex;
    flex-direction: column;
    overflow: hidden;
    div{
        margin: 20px 0;
        padding: 0 20px;
        overflow: auto;
    }
}
  h1 {
      display: block;
    font-size: 20px;
    margin-block-start: 0em;
    margin-block-end: 0.67em;
    margin-inline-start: 0px;
    margin-inline-end: 0px;
    font-weight: bold;
  }
  h2 {
  display: block;
  font-size: 16px;
  margin-block-start: 0em;
  margin-block-end: 0.83em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
  font-weight: bold;
}
p {
  line-height: 1.4;
  font-size: 14px;
  display: block;
  margin-block-start: 1em;
  margin-block-end: 1em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
}
</style>
