<template>
    <div class="doc-div">
        <div>
    <!-- 一级标题写在h1里面，二级标签写在h2里面，正文内容写在p里面， -->
    <h1>标准问题匹配（SSM）使用指南</h1>
    <p>标准问题匹配是我们训练机器人对客户对企业咨询问题时达到回应正确答案的能力。要让机器人正确回答问题，
        我们需要让机器人理解客户问的是什么问题？（标准问题）而客户会如何询问（训练语料），我们需要让机器人尽可
        能的理解客户咨询问题时的不同问法（训练），为了保证质量，我们还需要对训练后的机器人进行考核（测试）。最后发
        布上线后才能上线为客户提供最专业的服务（接入）</p>
    <h1>标准问题</h1>
    <h2>什么是标准问题？</h2>
    <p>标准问题是用户询问客服的业务问题。</p>
    <p>“我的包裹到哪去了？”和“我的快递到了没啊？”这些语料中的语义相同，为了让我们更便利的管理这
        些类似的问题，我们可以把这些问题分类为“快递查询”。而这个“快递查询“可以称为标准问题。我们也可以直接使用现有的标准问题。</p>
    <h2>为什么需要标准问题？</h2>
    <p>设定标准问题可以让我们更好的梳理业务问题，将不同的业务问题设计成标准问题后，用户询问的问题就能够被正确的理解并得到合适的回复。</p>
    <h2>该从哪里获得现有的标准问题？</h2>
    <p>如果不知道该怎么设计，我们可以寻找现有的标准问题。</p>
    <p>1. 如果曾使用过智能客服，我们可以直接使用当中的标准问题，也可以进行优化。</p>
    <p>2. 如果有人工客服，我们可以从客服手册等培训材料中得到用户常问的问题。 如果没有用户
        日志，我们依然可以利用本身对业务的了解自己设计标准问题，那我们就需要知道该如何设计良好的标准问题。</p>
    <h2>如何设计良好的标准问题？</h2>
    <p>标准问题对机器人来说非常重要，标准问题设计的好坏会直接影响到您的训练后正确率，需要认真对每个标准问题进行严谨的思考。在设计标准问题的时候需要注意以下几点：</p>
    <p>1、首先找到用户最常问的问题类型，先为它们设计标准问题。</p>
    <p>2、在设计标准问题时，需要明确区分，不要出现容易误解、混淆的标准问题。</p>
    <p>3、请不要设计有包含关系的标准问题（“公司的电话”这个标准问题可能也包含了“上海分公司的电话”）</p>
    <p>4、请不要设计两个名字很像、容易产生误解的标准问题（例如“个人主页无法显示”和“个人主页显示异常”）</p>
    <h2>标准问题模板是什么？为什么需要模板？</h2>
    <p>服务器只能接受特定格式的文档，所以希望在上传数据之前，请先下载我们的模板，按
        照模板的样式整理数据。标准问题的模板非常简单，它是这个样子的：只要把问题放在
        第一列，回答放在第二列，就可以了。整理好之后，记得保存为xlsx格式（excel2007及以后版本的文件格式）。</p>
    <h1>训练语料</h1>
    <h2>什么是训练语料？</h2>
    <p>一个标准问题会有不同的问法，这些不同种的问法就是训练语料，可以让机器人学习哪些问法对应了哪个标准问题，提高机器人识别标准问题正确率。</p>
    <p>机器人是根据语料来学习的。对于机器人来说，最好的语料是来自用户与客服人员对话的用户
        日志。但是很多时候我们没有办法得到用户日志，就需要自己模仿用户对每个标准问题写语料。
        为了方便您的使用，我们会将您添加的标准问题作为自身的语料数据。</p>
    <h2>什么是用户日志？</h2>
    <p>用户日志是用户与客服对话的记录列表。</p>
    <p>用户会对客服机器人问的各种不同问题，这些从用户手里获取到的第一手语料会更贴近用户的问法，这样的语料具有更高的质量。</p>
    <h2>什么是扩写？</h2>
    <p>扩写就是模拟用户可能的问法所设计的问题，进行扩写的时候需要注意以下几点：</p>
    <p>1、需要模仿用户对标准问题的不同问法。</p>
    <p>一个人的想法总是有限的，可以请几个人提供扩写语料，能覆盖更多的问法种类。</p>
    <h2>我该对每个标准问题准备多少条的语料？</h2>
    <p>根据我们的经验来看，10-30条的语料可以达到基本的正确率、30-50条语料可以达到中等的正确率、50-70条则可以达到精确的正确率。</p>
    <p>在某些项目中，有些标准问题达到100条以上，机器人正确回答的能力就更高了。建议在每个标注问题中准备至少10条以上的语料来确保机器人的回答质量。</p>

    <h2>我的上传语料数量为什么和原本上传的不一样？</h2>
    <p>在上传的过程中，我们将您不符合规范的语料进行了删减，您可以先在excel表格中进行修改再重新上传。</p>
    <p>语料模板是什么？为什么需要模板？</p>
    <p>服务器只可以接受特定格式的文档，所以希望您在上传数据
        之前，先下载我们的模板，并按照这个模板整理数据。模板中有两个栏位，分别是“
        料”栏以及“标准问题”栏。一个人的想法总是有限的，可以请几个人提供扩写语料，能覆盖更多的问法种类。</p>
    <h2>我的上传语料数量为什么和原本上传的不一样？</h2>
    <h1>训练</h1>
    <h2>什么是训练？</h2>
    <p>训练是让机器人学习的过程，我们将前面准备的语料和标准问题的对
        应关系放入模型，通过深度学习等人工智能技术，机器人就获得了回答相关问
        题的能力。可以说我们前面的语料增加和标注，都是为了训练提供基础，我们提供的语料越丰富、有代表性，训练出的机器人的问题回答能力就越强。</p>
    <h2>什么时候可以进行训练？</h2>
    <p>一个机器人需要有标准问题以及足够的训练语料，我们推荐为每个标准问题尽
        量提供10条以上的训练语料。当我们为每个标准问题都准备了充足的语料之后，就可以开始训练啦！我们的机器人就会依照您提供的信息学习用户语料是如何对应标准问题咯！</p>
    <p>当我们为每个标准问题都准备了充足的语料之后，就可以开始训练啦！我们的机器人就会依照您提供的信息学习用户语料是如何对应标准问题咯！</p>
    <h2>什么时候进行新一轮的训练？</h2>
    <p>1、新增或修改了原有的标准问题时。</p>
    <p>2、新增了新的训练语料。</p>
    <p>完成测试后，根据对应的正确率，对标准问题、语料进行了一些修改之后就可以开始新的训练；或在您增加了一批新的标准问题、新的语料后，也可以进行新的训练。</p>
    <p>总之在标准问题和语料有了比较多的改变之后都可以进行训练，来看看这些改变对机器人的效果如何。</p>
    <h2>需要多少语料才可以进行训练呢？</h2>
    <p>根据我们的经验来看，10-30条的语料可以达到基本的正确率、
        30-50条语料可以达到中等的正确率、50-70条则可以达到精确的正确率。在某些项目中，有些标
        准问题达到100条以上，机器人正确回答的能力就更高了。建议在每个标注问题中准备至少10条以上的语料来确保机器人的回答质量。</p>
    <h1>测试</h1>
    <h2>什么是测试？</h2>
    <p>我们训练好了机器人后，会需要一些测试题来检验机器人的学习效果。</p>
    <p>测试是模拟机器人面对真实用户时，是不是可以正确识别用户的
        提问属于哪个标准问题。为了让客户有个很棒的客服体验，我们需要确保较高的正确率。我们通过测试来了解机器人对语料的理解效果，找出机器人理解较差的标准问题，优化到令人满意的正确率。</p>
   <h2>该如何准备测试题？</h2>
    <p>准备测试集设计的好坏会影响到测试结果，以下提供几点建议：</p>
    <p>1、问法要尽可能贴近真实用户的问法，最好是之前留下的用户日志，如果没有，也可以请公司内部最贴近客户的员工来模仿客户的问法。</p>
    <p>2、您可以对每一个标准问题准备多点测试题，才可以真正反映标准问题的正确率，不然只能一题定生死，还是有些偏差的。</p>
    <p>3、可以按照标准问题被询问的频率来定测试题的数量，越常被问到就准备越多的测试题。建议可以让比较了解的同事粗略估计一下。</p>
    <p>4、当然，要确定您的测试题对应的“正确标准问题”是对的。有时候也会有不小心写错“正确标准问题”的状况发生。</p>
    <p>5、还有个小建议，当您从用户日志抽问题作为您的测试集时，需要检查一下这个问题里面是不是包含了好多个问题，或是句子很长，这个也会影响到测试结果。</p>
    <h2>测试集该怎么写呢？</h2>
    <p>你可以使用机器人工厂中编辑工具撰写测试题，你也可以使用我们提供的Excel模板来上传测试题。</p>
    <p>有件事情需要注意的是，表格当中的“正确标准问题”栏中的标准问题内容需要和系统中的标准问题一模一样，否则系统无法正确地判断。</p>
    <p>我们需要把给机器人的考题放进一个模板里，第一列放的是
        测试题，是用户可能问的问题，第二列则是正确答案，也就是这个语料应该对应的标准问题。上传后，系统会记录机器人对每个题目的答案，算出回答正确的比例，即测试结果。</p>
    <h2>什么时候可以开始测试？</h2>
    <p>在训练过后，我们就可以开始测试了。训练之前可以参考我们的小贴士（Tips：我还想让我的结果更好）</p>
    <p>正常的机器人训练和测试的流程</p>
    <p>正常情况下，当你建立新的机器人时，有以下几点需要准备：</p>
    <p>1、你需要针对每个标准问题准备训练语料</p>
    <p>2、每个标准问题要有3-4个标准问题，如果想要测试机器人对标准问题的覆盖率，你也可以增加更多的测试题。</p>
    <p>3、接下来你就可以训练并测试机器人了</p>
    <p>4、查看你的测试结果，如果出现真确率时，你可以查看我们的小贴士（我还想让我的结果更好</p>
    <h2>什么是正确率？</h2>
    <p>正确率是每次测试中，机器人预测正确的测试题在所有测试题中所占的比例。</p>
    <p>为什么我的标准问题正确率是N/A呢？</p>
    <p>要得到每个标准问题的正确率，需要在测试结束后才会出现。没有测试题的标准问题也会出现N/A这个状态。</p>
    <h2>什么是发布？</h2>
    <p>发布上线指的是将当前已训练的最新数据应用于用户的对话中。
        对话场景包括页面的线上对话，机器人已接入的各个渠道对话，比如微信公众号、
        企业微信，APP等。前面维护标准问答，数据训练和测试及报告均是线下操作，不会
        影响线上的数据和对话效果。审核者可以在【变更记录】审核过后，将上述变更数据进行训练，并发布到线上应用。</p>
    <p>标准问题和语料变更后，需要重新训练，建立新的模型。回答变更无需训练，所以分开两部分发布。如果想让变更的回答快速生效，可以只选择回答单独发布。</p>
</div>
  </div>
</template>

<script>
export default{
  data() {
    return {
      msg: 'haha',
    };
  },
};
</script>
<style lang="scss" scoped>
.doc-div{
    max-height: calc(100vh - 60px);
    display: flex;
    flex-direction: column;
    overflow: hidden;
    div{
        margin: 20px 0;
        padding: 0 20px;
        overflow: auto;
    }
}
  h1 {
      display: block;
    font-size: 20px;
    margin-block-start: 0em;
    margin-block-end: 0.67em;
    margin-inline-start: 0px;
    margin-inline-end: 0px;
    font-weight: bold;
  }
  h2 {
  display: block;
  font-size: 16px;
  margin-block-start: 0em;
  margin-block-end: 0.83em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
  font-weight: bold;
}
p {
  line-height: 1.4;
  font-size: 14px;
  display: block;
  margin-block-start: 1em;
  margin-block-end: 1em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
}
</style>
