<template>
    <div class="doc-div">
        <div>
      <h1>
            任务引擎（TE）使用指南
      </h1>
      <p>
          任务引擎（又叫多轮对话引擎）可以让用户设计可控的场景对话。
          常用标准问题能让机器人处理一问一答，或者结合上下文，回答两轮到三轮的问题。
          而多轮对话引擎是通过识别用户的意图（什么是意图？），将用户带入某一特定的任务场景中，
          通过多种信息抽取的方式，让机器人能够明白用户想要达成的目标，并帮助用户完成任务。
      </p>
      <h1>
          场景
      </h1>
      <h2>
          什么是场景？
      </h2>
      <p>
          场景是指在一定时间、空间内发生的一定的任务行动或因人物关系所构成的具体画面。在一段对话中，
          会产生一轮或多轮的对话交互，我们就把它的开始到结束归类为一个“场景”。举个例子，订机票的场景：
      </p>
      <p>
          用户：我想订机票 （ 识别出用户的意图 ）
      </p>
      <p>
        机器人：好的。请问你从哪里出发到哪里去？（ 回复场景中的话术 ）
      </p>
      <p>
          用户：从上海到北京
      </p>
      <p>
          机器人：出发地为上海市。到达地为北京市。好的。请问你的出发时间是几月几号？

      </p>
      <p>
          用户：后天的
      </p>
      <p>
          机器人：出发日期为2018年7月7日。好的。请问你对航空公司有要求吗？
      </p>
      <p>
          用户：要国航
      </p>
      <p>
          机器人：您的要求如下：出发地为上海市。到达地为北京市。出发日期为2018年7月7日。航空公司为CA。 是否为您预订？

      </p>
      <p>
          用户：好的，谢谢
      </p>
      <p>
          机器人：已帮您提交预定信息 （ 完成场景任务）
      </p>
      <p>
          多轮对话引擎首页会展示已经设计好的场景。我们可以点击“+创建场景”进行场景新建，也可以选择“+导入场景”将其他账户中已经设计好的场景内容直接导入。
      </p>
    <h1>
        多轮配置
    </h1>
    <p>
        创建好新场景后，进入配置界面， “入口节点”和“对话节点”是多轮对话配置的基本元素。
    </p>
    <h2>
        怎么设置入口节点？
    </h2>
    <p>
        入口节点分为三个部分：基本设置、连线和触发。
    </p>
    <p>
        基本设置：主要是对入口节点的名称进行修改（修改每个节点名称有助于后续连线时的辨别）
    </p>
    <p>
        连线：在触发场景时，指定对话流程的下一个对话节点。
    </p>
    <p>
        触发：是指当用户触发什么条件时，AI发起该场景。进入多轮对话场景后，我们使用“对话节点”作为每一轮对话的交互单位。每个节点都有特定的抽取信息功能。可以抽取时间、地点、数字等。
    </p>
    <h2>
        怎么设置对话节点？
    </h2>
    <p>
        设置“对话节点”之前，先前往 “预设节点对话数”设置节点对话轮数上限。
        “预设节点对话数”是指该轮对话若遭遇解析失败（无法识别用户的问题），则推送给用户解析失败文本的次数。若超过上限，则进行下一个指令动作。
    </p>
    <p>
        预设文本：指进入此节点后，机器人回复用户的语句。
    </p>
    <p>
        连线：连线和入口节点一样，都需要设定一个规则给机器人设别后再链接到下个对话节点。
    </p>
    <p>
        解析失败文本：当用户在看完预设文本并输入回复后，AI经过连线规则判断发现无法解析时，就会回复“解析失败文本”的内容。
    </p>
    <h2>
        什么是抽取用户回复的信息功能？
    </h2>
    <p>
        在看到机器人回复语句时，会做出一个回复。而我们会对用户回复的语句进行新的抽取，并存为一个变量，
        方便后面连线使用。例如，这个节点有一个动作，在询问“您要去哪个城市时”，抽取城市（City）的信息。什么是用户日志？
    </p>
    <h2>
        如何编写规则连接？
    </h2>
    <p>
        机器人抽取信息后，我们可以用这些信息进行连线的判断。例如，如果在预订酒店的场景中，在之前的对话中抽取到了“城市”，则前往“入住时间和离店时间询问”节点。
    </p>
    <p>
        依照上面的步骤逐步完善每一个节点即可完成一个场景。创建者在设计流程上需要设想多种情况，
        从而让机器人能覆盖更全面的对话场景。完成整个多轮场景的设置后，点击右上方的对话测试，就可以进行对话测试了。
    </p>
  </div>
    </div>
</template>

<script>
export default{
  data() {
    return {
      msg: 'haha',
    };
  },
};
</script>
<style lang="scss" scoped>
.doc-div{
    max-height: calc(100vh - 60px);
    display: flex;
    flex-direction: column;
    overflow: hidden;
    div{
        margin: 20px 0;
        padding: 0 20px;
        overflow: auto;
    }
}
  h1 {
      display: block;
    font-size: 20px;
    margin-block-start: 0em;
    margin-block-end: 0.67em;
    margin-inline-start: 0px;
    margin-inline-end: 0px;
    font-weight: bold;
  }
  h2 {
  display: block;
  font-size: 16px;
  margin-block-start: 0em;
  margin-block-end: 0.83em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
  font-weight: bold;
}
p {
  line-height: 1.4;
  font-size: 14px;
  display: block;
  margin-block-start: 1em;
  margin-block-end: 1em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
}
</style>
