<template>
   <div class="doc-div">
        <div>
    <!-- 一级标题写在h1里面，二级标签写在h2里面，正文内容写在p里面， -->
    <h1>词库使用指南</h1>
    <p>词库的作用是让机器人能够识别一些特殊词汇，并给出相应的回复。词库关系分类的一级目录默认包括：敏感词库，
        转人工词库，通用词库，标准问题词库，任务引擎词库，意图引擎词库，解析器词库。一级目录不可增改删。</p>
    <h1>词库分类和应用</h1>
    <p>【敏感词库】可以让机器人对一些关键字需要做特殊处理，并设置专有的回复。敏感词库不支持拼音纠错功能。例如：当涉及政治、
        竞争对手、投诉等信息时，你可以选择左侧分类中的【敏感词库】来添加相应的敏感词和该敏感词的同义词等，并在“敏感词回答”中添加你想设置的针对敏感词回复的内容，
        这样可以避免机器人回复不当造成的不良影响。设置后需要10-20s生效，完成后你可以在【对话测试】中检测设置结果。</p>
  <p>【转人工词库】：当用户说到对应的主词或者同义词时，会触发转人工回复。其中转人工话术在“话术设置”中设置的。转人工词库不支持拼音纠错功能。</p>
 <p>【通用词库】：当用户没有添加标准问题词库和意图引擎词库数据时。机器人会根据通用词库的数据来进行对话匹配。
     通用词库支持主词和同义词的拼音纠错，即当问句中的部分词语与主词或同义词拼音发音相似时，会进行转换。每个行业领域都有自己的专有名词。
     “通用词库”可以让机器人快速了解哪些词语是贵公司专属的用语，提升自然语言理解的覆盖率和准确率。比如：贵公司的产品名称，叫“活期盈”，
     就可以把这样的词设为专有名词，并把这个词的其他说法加为该专有名词的同义词。这样机器人在你的用户咨询到“活期盈”的时候，就不会理解错误。因为按照普遍知识，“活期”是一个词语。</p>
 <p>【标准问题词库】和【意图引擎词库】，当这两个一级目录下增加词条后，则问答管理模块和意图引擎模块各自受这两个模块的词条数据影响，
     而不受“通用词库”的数据影响。这两个目录的词库都支持拼音纠错功能。</p>
 <p>【任务引擎词库】：多轮对话场景中可能会涉及到一些对应的数据转换。我们提供了一些预设的模板，比如前面提到的订机票的场景，
     需要机器人能够识别什么是“国航”，就需要你把航空公司整理成相应的资料上传到平台。上传转换数据后能让机器人在场景中识别从而进行语义理解。</p>
 <p>【解析器词库】：定义词条后，方便用户在设置自定义解析器时，可以用该解析器词库辅助实体抽取等。</p>
 <h1>词库设置</h1>
    <p>在固定的一级词库关系下可以创建子关系，最多可以添加5级词库关系。词库关系设置主要是为了适配客户的业务分类要求。在同一个一级目录下的主词，同义词均不可重复。
词库状态的筛选：包括启用和停用。用户可以通过操作词库状态来控制词语是否应用。通过左侧的筛选，可以在右侧看到符合条件的词条列表。</p>
 <p>手动添加：指可以通过手动添加的方式来添加词条。</p>
    <p>编辑词条：点击编辑词条后，可以对词条的主词，同义词，词条状态，拼音纠错等进行编辑。</p>
 <p>批量导入：点击右上角的【数据导入】按钮，可以增量导入或全量导入词库数据。</p>
    <p>“新增数据”：只能新增没有重复且有效的词条数据</p>
    <p>“全量替换”：会先删除当前的所有数据，再上传Excel中的数据。</p>
<p>搜索：支持根据主词和同义词的关键词进行搜索</p>
    <p>批量启用/停用：勾选右侧词条的复选框，可以批量启用/停用词条状态。被选中的词条不   管当前状态是什么，都会按操作统一状态</p>
  <p>移动词条：勾选右侧的词条复选框，可以使用【移至】功能。</p>
    <p>批量删除：勾选右侧的词条复选框后，可以点击【批量删除】将选中的词条数据全部删除。</p>
  </div>
   </div>
</template>

<script>
export default{
  data() {
    return {
      msg: 'haha',
    };
  },
};
</script>
<style lang="scss" scoped>
.doc-div{
    max-height: calc(100vh - 60px);
    display: flex;
    flex-direction: column;
    overflow: hidden;
    div{
        margin: 20px 0;
        padding: 0 20px;
        overflow: auto;
    }
}
  h1 {
      display: block;
    font-size: 20px;
    margin-block-start: 0em;
    margin-block-end: 0.67em;
    margin-inline-start: 0px;
    margin-inline-end: 0px;
    font-weight: bold;
  }
  h2 {
  display: block;
  font-size: 16px;
  margin-block-start: 0em;
  margin-block-end: 0.83em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
  font-weight: bold;
}
p {
  line-height: 1.4;
  font-size: 14px;
  display: block;
  margin-block-start: 1em;
  margin-block-end: 1em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
}
</style>
