<template>
<div class="doc-div">
     <div>
    <!-- 一级标题写在h1里面，二级标签写在h2里面，正文内容写在p里面， -->
        <h1>长文本标注平台使用指南</h1>
            <p>长文本标注平台是一个针对长文本分类，信息抽取任务的的标注工具平台。实际应用中获得一个较好的长文本语义理解模型，
                或是需要提升模型的识别准确度，需要很多的标注数据进行训练。该标注平台是一个提升人工标注效率的长文本标注工具。
                用户可以新建任务，上传文本，通过辅助标注，语义纠错等功能快速进行文本的标注。</p>
        <h1>标注任务</h1>
            <h2>什么是标注任务？</h2>
            <p>任务是标注平台中的一个文件组，可以理解为，任务下标注文件都是基于同一个标注规则逻辑的。一个任务仅可有配置一个标签组，并上传多份文本
            </p>
            <h2>标注任务支持什么样的数据？</h2>
            <p>当前的标注平台仅支持TXT格式的文档。</p>
            <h2>如何进行文本标注？</h2>
            <p>在正式标注文档之前，需要先完成以下步骤。</p>
            <p>1、创建任务，编辑任务的名称，选择适用该任务的标注标签组</p>
            <p>2、如果没有适用的标签组，可以在标签管理页面新建标签组，之后进行关联</p>
            <p>3、批量上传需要标注的文档，仅支持TXT格式</p>
            <p>4、进入任务后，选择待标注的文档，进行标注</p>
            <p>5、标注完成后，点击页面中的完成，完成本次文件的标注</p>
        <h1>标签组</h1>
            <h2>什么是标签组？</h2>
        <p>一个任务中需要标注不同的信息，标签组就是预设了任务中需要标注的所有标签，供标注员在标注过程中进行选择。</p>
            <h2>有哪几类的标签组？</h2>
        <p>目前支持文本分类和信息抽取的标签组管理，两类标签组代表了两种不同的标注方式。
        文本分类是对一篇文档打标签。用户看完了一篇文档后，从预设的标签中，选择最适合该文本的一个或多个标签。类似于给某一篇文档配置一个对应的用户画像。</p>
            <p>信息抽取，则是对文本中的一个词，一句话，或者多句话的内容进行打标签。从文档中抽取出，关键的信息，从而形成概要，简报，或者抽取对应信息模型的训练数据</p>
            <h2>如何设置标签？？</h2>
        <p>在设置标签时，需要避免歧义，使用词组尽量简洁，能够保证每个人理解的都是同一个意思。尤其是在做训练数据的标注时，更要注意标签设置的合理性，避免标注结果产生冲突。</p>
        <h1>如何进行标注</h1>
            <h2>如何进行标注？</h2>
            <p>文本分析的标注，阅读完文档后，可以在右侧的文本分析列表中，新增适合的标签，选择完成后，
                点击提交，即可完成文本分析的标注。对于信息抽取，当看到文章中需要提取的关键信息是，
                鼠标左击需要提取内容的开始字符，拖动鼠标至需要提取内容的尾部，在弹窗中选择正确的标签，完成信息标注。</p>
        <h2>什么是辅助标注？</h2>
        <p>在标注时，为了提高标注的效率，在信息提取的标注中提供了两个AI工具，1、实体预抽取，2、抽取纠错</p>
        <p>1、实体预抽取：可以通过竹间的解析器，预抽取出文章中的人名，地点，时间点，基数词，机构名。方便标注员快速定位到相关信息的位置</p>
        <p>2、抽取纠错：在标注过程中，标注员有可能前后划词时，多划入内容，
            纠错功能就是通过竹间的语法句法模型，判断划出的内容是否会有语义歧义，从而通过划线的方式警示用户，存在句法错误。</p>
</div>
</div>
</template>

<script>
export default{
  data() {
    return {
      msg: 'haha',
    };
  },
};
</script>
<style lang="scss" scoped>
.doc-div{
    max-height: calc(100vh - 60px);
    display: flex;
    flex-direction: column;
    overflow: hidden;
    div{
        margin: 20px 0;
        padding: 0 20px;
        overflow: auto;
    }
}
  h1 {
      display: block;
    font-size: 20px;
    margin-block-start: 0em;
    margin-block-end: 0.67em;
    margin-inline-start: 0px;
    margin-inline-end: 0px;
    font-weight: bold;
  }
  h2 {
  display: block;
  font-size: 16px;
  margin-block-start: 0em;
  margin-block-end: 0.83em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
  font-weight: bold;
}
p {
  line-height: 1.4;
  font-size: 14px;
  display: block;
  margin-block-start: 1em;
  margin-block-end: 1em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
}
</style>
