<template>
   <div class="doc-div">
  <div>
    <!-- 一级标题写在h1里面，二级标签写在h2里面，正文内容写在p里面， -->
    <h1>运营管理使用指南</h1>
    <p>
        报表中心主要针对提供外呼任务和呼入情况的统计数据，为运营提供数据支持。
    </p>
    <h1>录音管理</h1>
    <h2>如何查看外呼任务的通话录音呢？</h2>
    <p>在录音管理中，所用通话的录音和日志都可以在这里查看、下载。默认显示外呼、最近7天的录音内容。</p>
    <h2>能查看到呼入电话的录音吗？</h2>
    <p>呼入通话的录音也在录音管理中，只要在上方的筛选框中，将“方向”更改为“呼入”，即可查看到呼入的录音</p>
    <h2>如果想找某个通话的录音要如何操作？</h2>
    <p>在页面上方提供了筛选框，基础搜索支持按照场景和任务进行搜索。</p>
    <p>高级搜索支持按照流水号、主叫号码、被叫号码、通话时长、通话时间进行搜索，多种搜索项的提供一定可以帮你找到想要的录音文件。</p>
    <h2>可以批量下载吗？</h2>
    <p>可以批量下载通话录音和通话日志。 勾选多个通话录音数据后，点击【批量下载录音】或者【导出日志】
</p>
    <h1>语音素材管理</h1>
    <h2>什么是语音素材管理？</h2>
    <p>语音素材管理模块，是用来允许用户提交事先录制好的录音文件作为替代TTS 实时合成的一种方案，或者将文本预先生成TTS语音文件，在对话中直接调用语音文件，无需等待TTS实时合成。
</p>
    <h2>使用语音素材有什么好处呢？</h2>
    <p>通过使用语音素材方案，能够减少等待TTS合成语音的时间，让智能对话过程中的客户体验更好。</p>
    <h2>语音素材有几种方案？</h2>
    <p>语音素材分为两种方案：</p>
    <p>1、TTS预先生成：将文本预先生成TTS语音文件，在对话中直接调用语音文件，无需等待TTS实时合成
</p>
<p>2、预录音：提交事先录制好的录音文件作为替代TTS 实时合成，如果话术全部为固定内容可以选择这种方案。
</p>
<h2>什么是场景语音素材？什么是标准问答语音素材？</h2>
<p>在电话机器人中，为了保证能够更好的理解用户的表达，一般会使用到机器人平台的标准问题和任务引擎模块，
    场景语音素材则是对应机器人平台中任务引擎模块，标准问答语音素材则对应机器人平台中问答管理模块，可以将不同模块的话术内容生成为语音素材。</p>
    <h2>
        如何使用TTS预先生成？
    </h2>
    <p>
        在场景语音素材中，点击右上角的【导入文本合成】，
        选择需要预先生成的机器人、场景和TTS服务，确认后列表中会新增对应场景的语音方案，
        点击【详情】进入场景详情页面，可以发现该场景话术均已同步至详情，点击【一键生成】则生成话术的TTS录音。
    </p>
    <p>
        标准问答的语音素材也是类似的操作，点击右上角的【导入标准问答方案】，
        选择对应的机器人和TTS服务，再点击【详情】进入详情页面【同步标准问】，
        同步成功后，页面会显示该机器人下所有标准问答内容。点击【一键生成】则生成话术的TTS录音。
    </p>
    <h2>
        什么时候需要更新TTS预生成内容？
    </h2>
    <p>
        当更新了场景或者标准问答中的话术后，需要更新TTS预生成的内容，否则在通话中依然会采用原来的旧话术。
    </p>
    <h2>
        如何更新TTS预生成内容？
    </h2>
    <p>
        在已经生成的方案详情页面，点击【同步场景】或者【同步标准问】，这时会把修改后的话术更新过来，再点击【一键生成】则会更新TTS预生成内容。
    </p>
    <h2>
        如何使用预录音方案？
    </h2>
    <p>
        在场景语音素材中，如果要使用预录音方案，则点击【新增预录音方案】，选择机器人、场景和需要上传的录音文件即可，一次可以上传或多个录音文件。
    </p>
    <p>
        在标准问答语音素材中，如果要使用预录音，则在方案详情中找到对应的标准问题，点击【上传替换】，上传录音文件。
    </p>
  </div>
   </div>
</template>

<script>
export default{
  data() {
    return {
      msg: 'haha',
    };
  },
};
</script>
<style lang="scss" scoped>
.doc-div{
    max-height: calc(100vh - 60px);
    display: flex;
    flex-direction: column;
    overflow: hidden;
    div{
        margin: 20px 0;
        padding: 0 20px;
        overflow: auto;
    }
}
  h1 {
      display: block;
    font-size: 20px;
    margin-block-start: 0em;
    margin-block-end: 0.67em;
    margin-inline-start: 0px;
    margin-inline-end: 0px;
    font-weight: bold;
  }
  h2 {
  display: block;
  font-size: 16px;
  margin-block-start: 0em;
  margin-block-end: 0.83em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
  font-weight: bold;
}
p {
  line-height: 1.4;
  font-size: 14px;
  display: block;
  margin-block-start: 1em;
  margin-block-end: 1em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
}
</style>
