<template>
   <div class="doc-div">
  <div>
    <!-- 一级标题写在h1里面，二级标签写在h2里面，正文内容写在p里面， -->
<h1>报表中心使用指南</h1>
    <p>报表中心主要针对提供外呼任务和呼入情况的统计数据，为运营提供数据支持。</p>
    <h1>外呼报表</h1>
    <h2>如何知道外呼任务的拨打情况？</h2>
    <p>在报表中心中，外呼报表中提供多种报表来反馈外呼任务的情况：</p>
    <p>名单表现结果报表】查看呼叫任务或者名单的拨打接通情况，包括已拨打数量、接通数量、转人工数量等，从这些数据可以了解外呼任务的拨打进度。</p>
    <p>【名单表现过程报表】–查看接通的通话数据，包括平均拨打次数、平均振铃时长、平均通话时长，通过这些数据可以反馈通话的情况，反映名单的质量。 </p>
     <h2>什么叫触达率？</h2>
    <p>通话接通超过10S，则定义为“触达”，触达率=通话时间大于10S的通话数量/名单数量</p>
     <h2>怎么知道哪些电话没有拨打成功？</h2>
    <p>在外呼报表中，可以在右上角切换报表，在【呼叫失败明细】可以查看哪些电话没有接通，这些通话是什么时候拨打的，没有接通的原因是什么。</p>
     <h2>拨打结果有几种？是怎么判断的？</h2>
    <p>拨打结果分为7种，为接通、接通转人工，忙线/拒接，无人接听，关机/飞行模式，不在服务区，未接通（其他原因），
        根据语音播报的提示进行分类，例如语音提示为“您所拨打的电话正在通话中”则会归类到忙线/拒接。</p>
     <h2>能不能知道每通电话的拨打详细数据？</h2>
    <p>在【 名单表现结果报表】中，每个任务会有【通时明细】，提供每一通电话拨打详情，例如拨打结果、拨打次数、首次拨打的时间、
        通话时长等，还提供每一个通话的录音。通时明细报表可以导出，方便进一步的统计编辑。</p>
     <h2>如何查看呼叫收集的用户反馈？</h2>
    <p>在【 名单表现结果报表】中，【任务报告】中会显示收集到的用户反馈，例如是不是用户本人等。在对话中收集哪些信息，是根据场景中的配置，不同的场景可以定制收集不同的信息。</p>
    <h1>呼入报表</h1>
    <h2>怎么知道呼入电话的对话内容？</h2>
    <p>在【呼入结果报表】中，会记录每一通呼入的电话，不仅包括来电时间、通话时长等，还可以知道来电的的场景和对话的结果，提供来电录音和日志可以查看。</p>
     <h2>怎么知道哪些呼入通话转人工了？</h2>
    <p>机器人不可能百分百回答全部的来电问题，解决不了的问题需要转入人工客服来解决，通过在右上角切换到【转人工报表】，
        可以查看到每天有多少呼入通话转入人工，转人工的通话占比多少，每个通话的对话内容。</p>
     <h2>转人工通话是怎么分类的？</h2>
    <p>根据不同的对话情况，将转人工通话分为4种情况</p>
    <p>【用户转--无对话】：通话接通后用户没有提问，而是直接要求转人工，例如：--您好，这里是智能客服，有什么可以帮您？  --转人工客服</p>
    <p>【用户转-已识别】：通话中，用户的提问机器人已经识别出，并且回答，但是用户依然要求转人工客服的情况</p>
    <p>【用户转-未识别】：通话中，用户的提问机器人没有听明白，用户要求转人工客服的情况</p>
    <p>【规则转人工】：在系统中设置了转人工规则，例如“连续3次无法回答用户问题启动转人工”，当通话中出现了这种情况，即使用户没有要求转人工，机器人会自动启动转人工。</p>
    <p>对于【用户转--无对话】的情况，因为没有机器人和用户的对话内容，在详情中不会显示这类型的通话记录。</p>
    <h2>什么是拦截率？</h2>
    <p>（呼入数量--转人工数量）/（呼入数量-规则转人工）</p>
  </div>
  </div>

</template>

<script>
export default{
  data() {
    return {
      msg: 'haha',
    };
  },
};
</script>
<style lang="scss" scoped>
.doc-div{
    max-height: calc(100vh - 60px);
    display: flex;
    flex-direction: column;
    overflow: hidden;
    div{
        margin: 20px 0;
        padding: 0 20px;
        overflow: auto;
    }
}
  h1 {
      display: block;
    font-size: 20px;
    margin-block-start: 0em;
    margin-block-end: 0.67em;
    margin-inline-start: 0px;
    margin-inline-end: 0px;
    font-weight: bold;
  }
  h2 {
  display: block;
  font-size: 16px;
  margin-block-start: 0em;
  margin-block-end: 0.83em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
  font-weight: bold;
}
p {
  line-height: 1.4;
  font-size: 14px;
  display: block;
  margin-block-start: 1em;
  margin-block-end: 1em;
  margin-inline-start: 0px;
  margin-inline-end: 0px;
}
</style>
